# 10 minutes to pandas
-----

# Basic data structures in pandas
Pandas provides two types of classes for handling data:

**Series:** a one-dimensional labeled array holding data of any type
such as integers, strings, Python objects etc.

**DataFrame:** a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

---

In [2]:
import numpy as np
import pandas as pd

# Object creation

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-04 -0.738729  0.695998  0.827075 -0.338679
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963
2013-01-06  1.204047  0.469156  0.352083 -0.629140

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)


df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

----
# Viewing data

In [8]:
df.head()

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-04 -0.738729  0.695998  0.827075 -0.338679
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.to_numpy()

array([[ 1.62784809, -0.47673721, -0.18912946, -0.01170715],
       [-0.32452191,  1.37305432,  0.78182463, -1.2177481 ],
       [-0.44353514,  1.32146518, -1.00927214, -1.83249737],
       [-0.73872866,  0.69599803,  0.82707512, -0.33867886],
       [-2.01798746,  1.44502554, -1.02562811, -0.12196275],
       [ 1.20404701,  0.46915618,  0.35208298, -0.62913959]])

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.115480  0.804660 -0.043841 -0.691956
std    1.337134  0.743852  0.838337  0.706211
min   -2.017987 -0.476737 -1.025628 -1.832497
25%   -0.664930  0.525867 -0.804236 -1.070596
50%   -0.384029  1.008732  0.081477 -0.483909
75%    0.821905  1.360157  0.674389 -0.176142
max    1.627848  1.445026  0.827075 -0.011707

In [12]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.627848   -0.324522   -0.443535   -0.738729   -2.017987    1.204047
B   -0.476737    1.373054    1.321465    0.695998    1.445026    0.469156
C   -0.189129    0.781825   -1.009272    0.827075   -1.025628    0.352083
D   -0.011707   -1.217748   -1.832497   -0.338679   -0.121963   -0.629140

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.011707 -0.189129 -0.476737  1.627848
2013-01-02 -1.217748  0.781825  1.373054 -0.324522
2013-01-03 -1.832497 -1.009272  1.321465 -0.443535
2013-01-04 -0.338679  0.827075  0.695998 -0.738729
2013-01-05 -0.121963 -1.025628  1.445026 -2.017987
2013-01-06 -0.629140  0.352083  0.469156  1.204047

In [14]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-06  1.204047  0.469156  0.352083 -0.629140
2013-01-04 -0.738729  0.695998  0.827075 -0.338679
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963

----
# Selection

In [15]:
df

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-04 -0.738729  0.695998  0.827075 -0.338679
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963
2013-01-06  1.204047  0.469156  0.352083 -0.629140

In [16]:
df['A']

2013-01-01    1.627848
2013-01-02   -0.324522
2013-01-03   -0.443535
2013-01-04   -0.738729
2013-01-05   -2.017987
2013-01-06    1.204047
Freq: D, Name: A, dtype: float64

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497

In [18]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-04 -0.738729  0.695998  0.827075 -0.338679

----
# Selection by label

In [19]:
df.loc[dates[1]]

A   -0.324522
B    1.373054
C    0.781825
D   -1.217748
Name: 2013-01-02 00:00:00, dtype: float64

In [20]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  1.627848 -0.476737
2013-01-02 -0.324522  1.373054
2013-01-03 -0.443535  1.321465
2013-01-04 -0.738729  0.695998
2013-01-05 -2.017987  1.445026
2013-01-06  1.204047  0.469156

In [21]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.324522  1.373054
2013-01-03 -0.443535  1.321465
2013-01-04 -0.738729  0.695998

In [22]:
df.loc[dates[0],"A"]

1.6278480946430312

In [23]:
df.at[dates[0], "A"]

1.6278480946430312

----
# Selection by position

In [24]:
df

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-04 -0.738729  0.695998  0.827075 -0.338679
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963
2013-01-06  1.204047  0.469156  0.352083 -0.629140

In [25]:
df.iloc[3]

A   -0.738729
B    0.695998
C    0.827075
D   -0.338679
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.738729  0.695998
2013-01-05 -2.017987  1.445026

In [27]:
df

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-04 -0.738729  0.695998  0.827075 -0.338679
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963
2013-01-06  1.204047  0.469156  0.352083 -0.629140

In [28]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.324522  0.781825
2013-01-03 -0.443535 -1.009272
2013-01-05 -2.017987 -1.025628

In [29]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497

In [30]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.476737 -0.189129
2013-01-02  1.373054  0.781825
2013-01-03  1.321465 -1.009272
2013-01-04  0.695998  0.827075
2013-01-05  1.445026 -1.025628
2013-01-06  0.469156  0.352083

In [31]:
df.iloc[1,1]

1.3730543247448166

In [32]:
df.iat[1,1]

1.3730543247448166

----
# Boolean indexing

In [33]:
df

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-02 -0.324522  1.373054  0.781825 -1.217748
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497
2013-01-04 -0.738729  0.695998  0.827075 -0.338679
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963
2013-01-06  1.204047  0.469156  0.352083 -0.629140

In [34]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707
2013-01-06  1.204047  0.469156  0.352083 -0.629140

In [35]:
df[df > 0]

                   A         B         C   D
2013-01-01  1.627848       NaN       NaN NaN
2013-01-02       NaN  1.373054  0.781825 NaN
2013-01-03       NaN  1.321465       NaN NaN
2013-01-04       NaN  0.695998  0.827075 NaN
2013-01-05       NaN  1.445026       NaN NaN
2013-01-06  1.204047  0.469156  0.352083 NaN

In [36]:
df2 = df.copy()

df2["E"] = ["one", "one", "two", "three", "four", "three"]

df2

                   A         B         C         D      E
2013-01-01  1.627848 -0.476737 -0.189129 -0.011707    one
2013-01-02 -0.324522  1.373054  0.781825 -1.217748    one
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497    two
2013-01-04 -0.738729  0.695998  0.827075 -0.338679  three
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963   four
2013-01-06  1.204047  0.469156  0.352083 -0.629140  three

In [37]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.443535  1.321465 -1.009272 -1.832497   two
2013-01-05 -2.017987  1.445026 -1.025628 -0.121963  four

----
# Setting

In [38]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df["F"] = s1

In [40]:
df.at[dates[0], "A"] = 0

In [41]:
df.iat[0, 1] = 0

In [42]:
df.loc[:, "D"] = np.array([5] * len(df))

In [43]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.189129  5.0  NaN
2013-01-02 -0.324522  1.373054  0.781825  5.0  1.0
2013-01-03 -0.443535  1.321465 -1.009272  5.0  2.0
2013-01-04 -0.738729  0.695998  0.827075  5.0  3.0
2013-01-05 -2.017987  1.445026 -1.025628  5.0  4.0
2013-01-06  1.204047  0.469156  0.352083  5.0  5.0

In [44]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.189129 -5.0  NaN
2013-01-02 -0.324522 -1.373054 -0.781825 -5.0 -1.0
2013-01-03 -0.443535 -1.321465 -1.009272 -5.0 -2.0
2013-01-04 -0.738729 -0.695998 -0.827075 -5.0 -3.0
2013-01-05 -2.017987 -1.445026 -1.025628 -5.0 -4.0
2013-01-06 -1.204047 -0.469156 -0.352083 -5.0 -5.0

----
# Missing data

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [46]:
df1.loc[dates[0] : dates[1], "E"] = 1

df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.189129  5.0  NaN  1.0
2013-01-02 -0.324522  1.373054  0.781825  5.0  1.0  1.0
2013-01-03 -0.443535  1.321465 -1.009272  5.0  2.0  NaN
2013-01-04 -0.738729  0.695998  0.827075  5.0  3.0  NaN

In [47]:
df1.dropna(how="any")

                   A         B         C    D    F    E
2013-01-02 -0.324522  1.373054  0.781825  5.0  1.0  1.0

In [48]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.189129  5.0  5.0  1.0
2013-01-02 -0.324522  1.373054  0.781825  5.0  1.0  1.0
2013-01-03 -0.443535  1.321465 -1.009272  5.0  2.0  5.0
2013-01-04 -0.738729  0.695998  0.827075  5.0  3.0  5.0

In [49]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

----
# Operations

In [50]:
df.mean()

A   -0.386788
B    0.884117
C   -0.043841
D    5.000000
F    3.000000
dtype: float64

In [51]:
df.mean(axis=1)

2013-01-01    1.202718
2013-01-02    1.566071
2013-01-03    1.373732
2013-01-04    1.756869
2013-01-05    1.480282
2013-01-06    2.405057
Freq: D, dtype: float64

In [52]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [53]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.443535  0.321465 -2.009272  4.0  1.0
2013-01-04 -3.738729 -2.304002 -2.172925  2.0  0.0
2013-01-05 -7.017987 -3.554974 -6.025628  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# User defined functions

In [54]:
df.agg(lambda x: np.mean(x) *5.6)

A    -2.166011
B     4.951053
C    -0.245511
D    28.000000
F    16.800000
dtype: float64

In [55]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000  -19.139901  506.0    NaN
2013-01-02  -32.841618  138.953098   79.120652  506.0  101.2
2013-01-03  -44.885756  133.732277 -102.138341  506.0  202.4
2013-01-04  -74.759340   70.435001   83.700002  506.0  303.6
2013-01-05 -204.220331  146.236585 -103.793565  506.0  404.8
2013-01-06  121.849558   47.478606   35.630798  506.0  506.0

----
# Value Counts

In [56]:
s = pd.Series(np.random.randint(0, 7, size=10))

s

0    3
1    4
2    2
3    5
4    3
5    1
6    5
7    4
8    3
9    1
dtype: int32

In [57]:
s.value_counts

<bound method IndexOpsMixin.value_counts of 0    3
1    4
2    2
3    5
4    3
5    1
6    5
7    4
8    3
9    1
dtype: int32>

# String Methods

In [58]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

----
# Merge
---

# Concat

In [59]:
import pandas as pd
df = pd.DataFrame(np.random.randn(10, 4))

df

          0         1         2         3
0 -0.266840 -1.070881  1.638519  0.398853
1  0.012365  0.670560  0.343538  1.726931
2  1.298998  0.833065  0.787309  0.381992
3  0.539235  2.445875 -1.443479 -0.999326
4 -0.258727 -1.544813 -1.278313 -1.485586
5  0.778354  0.131498 -1.131287 -0.041134
6  0.553604 -0.067727  0.814465 -1.329471
7 -0.955237  0.513034 -0.268093 -1.537019
8 -0.506677  1.349314  0.615743 -1.815680
9 -0.725707  0.162003 -0.637407  2.014105

In [60]:
pieces = [df[:3], df[3:7], df[7:]]

pd.concat(pieces)

          0         1         2         3
0 -0.266840 -1.070881  1.638519  0.398853
1  0.012365  0.670560  0.343538  1.726931
2  1.298998  0.833065  0.787309  0.381992
3  0.539235  2.445875 -1.443479 -0.999326
4 -0.258727 -1.544813 -1.278313 -1.485586
5  0.778354  0.131498 -1.131287 -0.041134
6  0.553604 -0.067727  0.814465 -1.329471
7 -0.955237  0.513034 -0.268093 -1.537019
8 -0.506677  1.349314  0.615743 -1.815680
9 -0.725707  0.162003 -0.637407  2.014105

In [61]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

left

   key  lval
0  foo     1
1  foo     2

In [62]:
right

   key  rval
0  foo     4
1  foo     5

In [63]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

----
# Grouping

In [64]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)


df

     A      B         C         D
0  foo    one  0.051268  0.594671
1  bar    one -0.866727  1.777005
2  foo    two -0.085075 -2.684385
3  bar  three  0.782390  0.406047
4  foo    two -0.288333  0.218663
5  bar    two  1.694855  1.377854
6  foo    one  0.915460 -0.244142
7  foo  three -0.203099  1.002206

In [68]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar  1.610518  3.560907
foo  0.390221 -1.112986

In [69]:
df.groupby(["A","B"]).sum()

                  C         D
A   B
bar one   -0.866727  1.777005
    three  0.782390  0.406047
    two    1.694855  1.377854
foo one    0.966728  0.350529
    three -0.203099  1.002206
    two   -0.373408 -2.465721

----
# Reshaping